src/cf/Catalogs/узИсторияКонфигураций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>узИсторияКонфигураций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.узКонфигурации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидИзменения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.узВидыИзменений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узИдентификаторыОбъектовМетаданныхКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/узЗаписиИсторииКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>узЗаписиИсторииКонфигурации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаписьИсторииХранилища</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узИсторияКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узИдентификаторыОбъектовМетаданныхКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/узИсторияКонфигураций/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	СформироватьЗаписиВРС_узИсторияХранилища(Отказ);
КонецПроцедуры

Процедура СформироватьЗаписиВРС_узИсторияХранилища(Отказ)
	ТЗДанныеДляЗаписи = ПолучитьТЗДанныеДляЗаписи();
	Для каждого СтрокаТЗДанныеДляЗаписи из ТЗДанныеДляЗаписи цикл
		МенеджерЗаписи = РегистрыСведений.узЗаписиИсторииКонфигурации.СоздатьМенеджерЗаписи();	
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаТЗДанныеДляЗаписи);
		МенеджерЗаписи.Записать();
	Конеццикла;
КонецПроцедуры 

Функция ПолучитьТЗДанныеДляЗаписи() 
	ТЗДанныеДляЗаписи = РегистрыСведений.узЗаписиИсторииКонфигурации.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для каждого СтрокаИзмененныеОбъекты из ИзмененныеОбъекты цикл
		пИдентификаторОбъектаМетаданных = СтрокаИзмененныеОбъекты.ИдентификаторОбъектаМетаданных;		
		ДобавитьВТЗДанныеДляЗаписи(пИдентификаторОбъектаМетаданных,ТЗДанныеДляЗаписи);
	Конеццикла;
	Возврат ТЗДанныеДляЗаписи;
КонецФункции 

Процедура ДобавитьВТЗДанныеДляЗаписи(ЗНАЧ ИдентификаторОбъектаМетаданныхРебенок,ТЗДанныеДляЗаписи)
	Если ТЗДанныеДляЗаписи.Найти(ИдентификаторОбъектаМетаданныхРебенок,"ИдентификаторОбъектаМетаданных") = Неопределено Тогда
		СтрокаТЗДанныеДляЗаписи = ТЗДанныеДляЗаписи.Добавить();	
		СтрокаТЗДанныеДляЗаписи.Период = ДатаВерсии;
		СтрокаТЗДанныеДляЗаписи.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданныхРебенок;
		СтрокаТЗДанныеДляЗаписи.ЗаписьИсторииХранилища = Ссылка;		
	Конецесли;
	
	РодительИдентификатораОбъектаМетаданных = ИдентификаторОбъектаМетаданныхРебенок.Родитель; 
	Если ЗначениеЗаполнено(РодительИдентификатораОбъектаМетаданных) Тогда
		ДобавитьВТЗДанныеДляЗаписи(РодительИдентификатораОбъектаМетаданных,ТЗДанныеДляЗаписи)	
	Конецесли;
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда
		ЗаполнитьВерсиюДляВводаВручную();
	Конецесли;
КонецПроцедуры

Процедура ЗаполнитьВерсиюДляВводаВручную()
	Если НЕ ВводВручную Тогда
		Возврат;
	Конецесли;
	Если ЗначениеЗаполнено(Версия) Тогда
		Возврат;	
	Конецесли;
	Версия = Справочники.узИсторияКонфигураций.ПолучитьНовуюВерсиюДляВводаВручную(Владелец);
КонецПроцедуры
